tutorials/pillowLava/deg30_PillowLava/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  leftWall
  {
    type            fixedValue;
    value           uniform 0;
  }

  rightWall
  {
    type            fixedFluxPressure;
    value           uniform 0;
    // type uniformFixedValue;
    // uniformValue table
    // (
    //     (0 300000)
    //     (10000 300000)
    //     (20000 200000)
    //     (50000 200000)
    // );
  }

  bottom
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  tunnelWallsTop
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }
  topLava
  {
    type            fixedValue;
    value           uniform 0;
  }
  atmosphere
  {
      type            fixedValue;
      value           uniform 0;
  }

  tunnelWallsLeft
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }

  tunnelWallsRight
  {
    type            fixedFluxPressure;
    value           uniform 0;
  }

  front
  {
    type            empty;
  }
  back
  {
    type           empty;
  }



}


// ************************************************************************* //
