tutorials/pillowLava/deg30_PillowLava/0.orig/alpha.lava
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.lava;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }

    rightWall
    {
//      type            fixedValue;
  //    value           uniform 1;
        type            zeroGradient;

}

    bottom
    {
        type            zeroGradient;
    }
    tunnelWallsTop
    {
        type            zeroGradient;
    }
    topLava
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }

    tunnelWallsLeft
    {
      type            zeroGradient;
    }
    tunnelWallsRight
    {
      type            zeroGradient;
    }


    front
    {
      type            empty;
    }
    back
    {
      type            empty;
    }
}


// ************************************************************************* //
